Revit 2020 API
MEPModel.ConnectorManager Property
Retrieves the Connector Manager from this MEPModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public ConnectorManager ConnectorManager { get; }
Visual Basic
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
Visual C++
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
Field Value
null if there is no connector manager supported for this MEPModel.
See Also
MEPModel Class
Autodesk.Revit.DB Namespace